{
  "id": "immersion",
  "title": "Immersion_projects",
  "illustration": "/public/data/iot-projects/immersion.png",
  "links": {
	"PDF": "",
	"Slides": "",
	"Video": "F6XeG3sRFKY",
	"Code": ""
  },
  "topics": ["ml", "ai"],
  "authors": [
      "Heba Kaddouh",
      "Mohamed Ben Saad",
      "Jessy Colombo",
      "Khalid Barakat"
  ],
  "Immersion_projects": {
    "TEAM MEMBRES :": [
      "Name: Heba Kaddouh [Hebakaddouh](https://github.com/Hebakaddouh)\nEmail : heba.kaddouh@gmail.com",
      "Name: Mohamed Ben Saad [Mohaabenz](https://github.com/Mohaabenz)\nEmail : bensaad.mohamedamine@gmail.com",
      "Name: Jessy Colombo [Greyman93](https://github.com/Greyman93)\nEmail : jessy.colombo31@gmail.com",
      "Name: Khalid Barakat [Giitto](https://github.com/Giitto)\nEmail : bckhalid@hotmail.fr"
    ],
    "Name products : Set-up Immersion 3.5D;": ""
  },
   "abstract": "LED : Il s'agit d'une bande LED connectée à votre smartphone en bluetooth que vous pourrez contrôler à votre guise. \nMais la particularité de cette bande est son mode immersif : Elle s'adaptera automatiquement aux couleurs prédominantes,\nque ce soit pour un jeu video, un film ou juste une image, l'expérience est garantie. Fauteuil: Pour le moment, il s'agit d'une évolution du set-up qui permettrait une meilleure immersion quelque soit l'action. \nPour cela deux enceintes connectées à votre périphérique en bluetooth ou en filaire ammeneront le son au plus proche de soit. \nAux cotées de ces enceintes, nous allons intégrer des capteurs sonores liés à notre ESP32 qui permettront d'analyser le son. \nAprès analyse, des vibrations seront activé en fonction de l'action. Par exemple, si le bruit d'un balle de pistolet est entendu, \nles moteurs vibrants situés sur le dos de la chaise s'activeronts. Application : L'application permettra de contrôler la bande LED. Elle pourra allumer ou éteindre la bande, activer les differents modes de \n\ncelle-ci, augmenter ou diminuer la lumière ou bien changer la couleur de la bande.\n\nEn fonction de l'avancement du projet, nous pourrons ajouter d'autres amélioration, options, composant et objets connectés sur notre set-up",
    "Composants :": [
      "LED : ESP32, BANDE LED, Capteurs couleur de lumière, cable USB, kit de connection (fil) ;",
      "Fauteuil : housse massage ou moteurs vibrants, enceinte bluetooth, ESP32, capteurs sonores; "
    ]
}
